server/files/soap/faktureImport.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <importFakturaRequest xmlns="http://poslovna.com/soap-example">
            <faktura>
                <id>[long]</id>
                <broj>fa13</broj>
                <datum>[dateTime]</datum>
                <datumValute>[dateTime]</datumValute>
                <ukupanRabat>15.5</ukupanRabat>
                <bezPDV>20.5</bezPDV>
                <ukupanPDV>50.5</ukupanPDV>
                <ukupnoZaPlacanje>5050.00</ukupnoZaPlacanje>
                <preostaliIznos>5050.0</preostaliIznos>
                <narudzbenica>
                    <id>[long]</id>
                    <stavkaNarudzbenice>
                        <id>[long]</id>
                        <kolicina>[double]</kolicina>
                        <proizvod>[string]</proizvod>
                    </stavkaNarudzbenice>
                </narudzbenica>
                <kupac>
                    <id>[long]</id>
                    <naziv>SDD Technology Group</naziv>
                    <pib>12121212120</pib>
                    <brojRacuna>123-9876543211234-45</brojRacuna>
                    <adresa>
                        <id>[long]</id>
                        <broj>11a</broj>
                        <ulica>Karadjordjeva</ulica>
                        <grad>Beograd</grad>
                        <postanskiBroj>11000</postanskiBroj>
                        <drzava>Srbija</drzava>
                    </adresa>
                </kupac>
                <prodavac>
                    <id>[long]</id>
                    <naziv>Victoria Oil</naziv>
                    <pib>12121212121</pib>
                    <brojRacuna>123-9876543211234-48</brojRacuna>
                    <adresa>
                        <id>[long]</id>
                        <broj>21</broj>
                        <ulica>Jelice Stanivukovic</ulica>
                        <grad>Sid</grad>
                        <postanskiBroj>22240</postanskiBroj>
                        <drzava>Srbija</drzava>
                    </adresa>
                </prodavac>
                <poslovnaGodina>2018</poslovnaGodina>
                <stavkaFaktureList>
                    <stavkaFakture>
                        <id>[long]</id>
                        <osnovica>20.5</osnovica>
                        <iznosRabata>011.5</iznosRabata>
                        <procenatRabata>10.5</procenatRabata>
                        <stopaPdv>10.5</stopaPdv>
                        <iznosPdv>20</iznosPdv>
                        <jedinicnaCena>1000.00</jedinicnaCena>
                        <kolicinaStavkeFakture>5</kolicinaStavkeFakture>
                        <ukupanIznos>5000.00</ukupanIznos>
                        <proizvod>Papir</proizvod>
                    </stavkaFakture>
                </stavkaFaktureList>
            </faktura>
        </importFakturaRequest>
    </Body>
</Envelope>